<template>
  <transition name="modal" appear>
    <div class="modal modal-overlay" @click.self="$emit('close')">
      <div class="modal-window">
        <div class="modal-content">
          <div class="privacy-modal-container">
            개인정보 처리방침 <br /><br />주식회사 동행365(이하 ‘폐업119’라고
            합니다)는 개인정보 보호법 및 정보통신망 이용촉진 및 정보보호 등에
            관한 법률등 관련 법령에 따라 이용자의 개인정보를 보호하고 이와
            관련한 고충을 신속하고 원활하게 처리할 수 있도록 하기 위하여 다음과
            같이 개인정보 처리방침을 수립․공개합니다. <br /><br />1. 개인정보의
            수집 목적 <br />폐업119는 다음의 목적을 위하여 개인정보를 처리하고
            있으며, 다음의 목적 이외의 용도로는 이용하지 않습니다.<br /><br />
            - 이용자의 가입의사 확인, 이용자에 대한 서비스 제공에 따른 본인
            식별.인증, 회원자격 유지.관리 회원탈퇴 의사의 확인, 이벤트 정보 및
            참여기회 제공, (고객의 경우)광고성 정보 제공 등 마케팅 및 프로모션,
            상담 및 방문견적 등 각종 서비스 제공을 위한 폐업119 운영자 및 협력
            파트너(사)에 정보 제공, (파트너사의 경우)고객 견적 의뢰 정보 제공,
            물품 또는 서비스 공급에 따른 금액 결제, 물품 또는 서비스의
            공급.배송, 당사자간 계약이행사항 확인, 법령 및 이용약관을 위반하는
            회원에 대한 이용 제한 조치, 부정 이용 행위를 포함하여 서비스의
            원활한 운영에 지장을 주는 행위에 대한 방지 및 제재, 계정도용 및
            부정거래 방지, 약관 개정 등의 고지사항 전달, 분쟁조정을 위한 기록
            보존, 민원처리 등 이용자 보호 및 서비스 운영, 서비스 이용기록과 접속
            빈도 분석, 서비스 이용에 대한 통계, 서비스 분석 및 통계에 따른 맞춤
            서비스 제공 및 광고 게재, 보안, 프라이버시, 안전 측면에서 이용자가
            안심하고 이용할 수 있는 서비스 이용환경 구축 등 <br /><br />2.
            개인정보의 수집 항목 <br />폐업119는 회원가입 및 견적상담, 공사대금
            이자지원 신청 시 다음의 항목을 수집합니다. <br /><br />- 필수항목:
            아이디(이메일), 비밀번호, 이름, 닉네임, 전화번호(휴대전화번호 또는
            자택전화번호), (파트너사의 경우)업체명·영업장 주소·향후 고객과의
            통화 여부, 위치정보, (고객의 경우)주소·거주정보·고객의 공사 대상
            소유물 또는 점유물을 촬영한 촬영물 <br /><br />3. 개인정보의 수집
            방법 <br />폐업119는 다음의 방법으로 개인정보를 수집합니다.
            <br /><br />- 모바일 애플리케이션, 홈페이지, 서면 양식, 전화/팩스,
            이벤트 응모 - 생성정보 수집 툴을 통한 수집 - 기타 기술적 방법을 통한
            수집<br /><br />
            4. 개인정보의 처리 및 보유 기간 <br />① 폐업119는 이용자로부터
            개인정보를 수집할 때 동의 받은 개인정보 보유․이용기간 또는 법령에
            따른 개인정보 보유․이용기간 내에서 개인정보를 처리․보유합니다.
            <br /><br />② 폐업119는 보유목적 달성 시 또는 이용자가 개인정보
            삭제를 요청할 경우 이용자의 개인정보를 지체 없이 파기합니다. 단,
            이용자에게 개인정보 보관기간에 대해 별도의 동의를 얻은 경우, 또는
            아래 법령에서 일정 기간 정보보관 의무를 부과하는 경우에는 해당 기간
            동안 동의 내용 또는 법령의 규정의 내용 및 목적에 맞게 개인정보를
            안전하게 보관합니다. <br /><br />- 전자상거래 등에서 소비자 보호에
            관한 법률 <br /><br />계약 또는 청약철회 등에 관한 기록: 5년 보관
            대금결제 및 재화 등의 공급에 관한 기록: 5년 보관 소비자의 불만 또는
            분쟁처리에 관한 기록: 3년 보관 <br /><br />- 전자금융거래법
            <br /><br />전자금융에 관한 기록: 5년 보관 <br /><br />-
            통신비밀보호법 <br /><br />로그인 기록: 3개월 <br /><br />5.
            개인정보의 파기 <br />① 폐업119는 원칙적으로 개인정보 처리목적이
            달성된 경우에는 지체없이 해당 개인정보를 파기합니다. <br />파기의
            절차, 기한 및 방법은 다음과 같습니다. <br /><br />- 파기절차:
            이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져(종이의 경우
            별도의 서류) 내부 방침 및 기타 관련 법령에 따라 일정기간 저장된 후
            혹은 즉시 파기됩니다. 이 때, DB로 옮겨진 개인정보는 법률에 의한
            경우가 아니고서는 다른 목적으로 이용되지 않습니다.<br />- 파기기한:
            이용자의 개인정보는 개인정보의 보유기간이 경과된 경우에는 보유기간의
            종료일로부터 5일 이내에, 개인정보의 처리 목적 달성, 해당 서비스의
            폐지, 사업의 종료 등 그 개인정보가 불필요하게 되었을 때에는
            개인정보의 처리가 불필요한 것으로 인정되는 날로부터 5일 이내에 그
            개인정보를 파기합니다. <br />- 파기방법: 전자적 파일 형태의 정보는
            기록을 재생할 수 없는 기술적 방법을 사용합니다. 종이에 출력된
            개인정보는 분쇄기로 분쇄하거나 소각을 통하여 파기합니다.
            <br /><br />6. (고객의)개인정보 제 3자 제공에 관한 사항 <br />①
            제공받는 자 <br /><br />- 폐업119 사업파트너사: [전체보기] <br />-
            (이벤트 제휴서비스 신청시) 해당 제휴사(이하 ‘제휴사’) <br />- (광고
            제외 식별 목적시) 해당 광고대행사(이하 ‘광고대행사’) <br />②
            제공받는 자의 이용 목적 <br />- (파트너사에게 제공하는 경우)
            견적상담, 방문견적, 계약체결 등 <br />- (제휴사에게 제공하는 경우)
            해당 제휴사 서비스에 대한 정보, 광고, 홍보, 이벤트 제공 <br />-
            (광고대행사에게 제공하는 경우) 광고 제외 식별 목적 <br />③ 제공할
            개인정보의 항목 <br /><br />- (파트너사에게 제공하는 경우) 이름,
            전화번호, 휴대폰번호, 시공지역의 주소, 서비스 이용과정에서 이용자가
            입력한 정보 및 작성한 저작물 <br />- (제휴사에게 제공하는 경우)
            이름, 휴대폰번호 <br />- (광고대행사에게 제공하는 경우) 휴대폰번호
            <br />④ 제공받은 자의 개인 정보 보유․이용 기간 <br /><br />- 위
            개인정보는 (제공된 날부터) 파트너사에게 제공되는 경우 1년, 제휴사
            또는 광고대행사에게 제공되는 경우 6개월 간 각 보유·이용되며 보유목적
            달성 시 또는 정보주체가 개인정보 삭제를 요청할 경우 지체 없이
            파기합니다. <br />- 단, 이용자에게 개인정보 보관기간에 대해 별도의
            동의를 얻은 경우, 또는 아래 법령에서 일정 기간 정보보관 의무를
            부과하는 경우에는 해당 기간 동안 동의 내용 또는 법령의 규정의 내용
            및 목적에 맞게 개인정보를 안전하게 보관합니다. <br /><br />-
            전자상거래 등에서 소비자 보호에 관한 법률 <br /><br />계약 또는
            청약철회 등에 관한 기록: 5년 보관 <br />대금결제 및 재화 등의 공급에
            관한 기록: 5년 보관 <br />소비자의 불만 또는 분쟁처리에 관한 기록:
            3년 보관<br /><br />- 전자금융거래법 <br /><br />전자금융에 관한
            기록: 5년 보관 <br /><br />- 통신비밀보호법<br /><br />
            로그인 기록: 3개월 <br /><br />7. 이용자 및 법정대리인 권리와 그
            행사방법 <br />⓵ 이용자 및 법정대리인은 등록되어 있는 이용자 본인
            혹은 당해 만 14세 미만자의 개인정보 관련하여, 언제든지 개인정보
            열람/ 정정•삭제/ 처리정지/ 동의 철회를 요청할 수 있습니다.
            <br /><br />이를 위하여 이용자 및 법정대리인은 폐업119에 언제든지
            대표전화(1600-3069) 또는 개인정보 보호책임자에게 전화 또는 이메일로
            연락하시면 지체없이 조치하겠습니다. <br /><br />폐업119는 다음 각 호
            중 어느 하나에 해당하는 경우에는 개인정보의 전부 또는 일부에 대하여
            열람/ 정정•삭제를 거절할 수 있습니다. <br /><br />1. 법률에 따라
            열람이 금지되거나 제한되는 경우 <br />2. 다른 사람의 생명•신체를
            해할 우려가 있거나 다른 사람의 재산과 그 밖의 이익을 부당하게 침해할
            우려가 있는 경우 <br /><br />⓶ 이용자 및 법정대리인가 개인정보의
            오류에 대한 정정을 요청하신 경우에는 정정을 완료하기 전까지 당해
            개인정보를 이용 또는 제3자에게 제공하지 않습니다. 또한 잘못된
            개인정보를 제3자에게 이미 제공한 경우에는 정정 처리결과를 제3자에게
            지체 없이 통지하겠습니다. <br /><br />폐업119는 이용자 혹은
            법정대리인의 요청에 의해 삭제/처리 정지된 개인정보는 “4. 개인정보의
            처리 및 보유기간”에 명시된 바에 따라 처리하고 그 외의 용도로 열람
            또는 이용할 수 없도록 처리하고 있습니다. 이용자의 개인정보를 최신의
            상태로 정확하게 입력하여 주시기 바랍니다. 이용자가 입력한 부정확한
            정보로 인해 발생하는 사고의 책임은 이용자 자신에게 있으며 타인
            정보의 도용 등 허위정보를 입력할 경우 회원자격이 상실될 수
            있습니다.<br /><br />
            이용자는 개인정보를 보호 받을 권리와 함께 스스로를 보호하고 타인의
            정보를 침해하지 않을 의무도 가지고 있습니다. 비밀번호를 포함한
            이용자의 개인정보가 유출되지 않도록 조심하시고 게시물을 포함한
            타인의 개인정보를 훼손하지 않도록 유의해 주십시오. 만약 이 같은
            책임을 다하지 못하고 타인의 정보 및 존엄성을 훼손할 시에는
            「정보통신망 이용촉진 및 정보보호 등에 관한 법률」 등에 의해 처벌
            받을 수 있습니다. <br /><br />8. 개인정보 보호책임자 <br />①
            폐업119는 개인정보 처리에 관한 업무를 총괄해서 책임지고, 개인정보
            처리와 관련한 정보주체의 불만처리 및 피해구제 등을 위하여 아래와
            같이 개인정보 보호책임자를 지정하고 있습니다. <br /><br />▶ 개인정보
            보호책임자 <br />성명: 이근표 <br />연락처: 1800-7886, 이메일 :
            lkp106@with365.co.kr <br /><br />② 정보주체께서는 폐업119의
            서비스(또는 사업)을 이용하시면서 발생한 모든 개인정보 보호 관련
            문의, 불만처리, 피해구제 등에 관한 사항을 개인정보 보호책임자 및
            담당부서로 문의하실 수 있습니다. 폐업119는 정보주체의 문의에 대해
            지체 없이 답변 및 처리해드릴 것입니다. <br /><br />9. 개인정보
            처리방침 변경 이 개인정보처리방침은 시행일로부터 적용되며, 법령 및
            방침에 따른 변경 내용의 추가, 삭제 및 정정(이하‘개정’)이 있는
            경우에는 변경사항의 시행 7일 전부터 공지사항을 통하여 고지할
            것입니다. 이때 폐업119는 정보주체에게 위 개정사항에 대한 동의 여부를
            확인하며, 정보주체가 동의하지 않는 경우 폐업119에 대한 개인정보의
            수집·이용 및 제3자 제공에 관한 동의를 철회할 수 있습니다.
            <br /><br />10. 개인정보 자동 수집 장치의 설치/운영 및 거부에 관한
            사항 <br />① 폐업119는 이용자의 정보를 수시로 저장하고 찾아내는
            쿠키(cookie) 등 개인정보를 자동으로 수집하는 장치를 설치, 운용할 수
            있습니다. 쿠키란 폐업119 서비스를 운영하는데 이용되는 서버가
            이용자의 브라우저에 보내는 아주 작은 텍스트 파일로서 이용자의 컴퓨터
            하드디스크에 저장됩니다. 쿠키의 사용 목적은 이용자 접속 빈도나 방문
            시간 등을 분석을 통한 타겟 마케팅 및 개인 맞춤 서비스 제공에
            있습니다. <br /><br />② 이용자는 쿠키 설치에 대한 선택권을 가지고
            있습니다. 웹 브라우저에서 옵션을 설정함으로써 모든 쿠키를 허용하거나
            거부할 수 있습니다. <br /><br />11. 개인정보의 수집·이용·제3자
            제공에 대한 동의를 거부·철회할 권리 및 그 경우의 불이익 <br />①
            이용자는 개인정보의 수집·이용·제3자 제공에 대하여 동의를 하지 않을
            수 있고, 언제든지 그 동의를 철회할 수 있습니다. 다만 동의를
            거부·철회시 정상적인 폐업119 서비스 이용이 제한될 수 있습니다.
          </div>
        </div>
        <footer class="modal-footer">
          <button @click="$emit('close')">확인</button>
        </footer>
      </div>
    </div>
  </transition>
</template>

<style lang="stylus" scoped>
.modal {
  &.modal-overlay {
    display: flex;
    align-items: center;
    justify-content: center;
    position: fixed;
    z-index: 1000;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    background: rgba(0, 0, 0, 0.5);
  }

  &-window {
    background: #fff;
    border-radius: 4px;
    overflow: hidden;
  }

  &-content {
    padding: 10px 20px;
  }

  &-footer {
    background: #ccc;
    padding: 10px;
    text-align: right;
  }
}
.address {
    text-align: left;
    width: 65%;
    height: 35px;
    background: #fff;
    overflow: hidden;
    padding-top: 5px;
    padding-left: 10px
    margin-top: 15px;
}
// 오버레이 트랜지션
.modal-enter-active, .modal-leave-active {
  transition: opacity 0.4s;

  // 오버레이에 포함되어 있는 모달 윈도의 트랜지션
  .modal-window {
    transition: opacity 0.4s, transform 0.4s;
  }
}

// 딜레이가 적용된 모달 윈도가 제거된 후에 오버레이가 사라짐
.modal-leave-active {
  transition: opacity 0.6s ease 0.4s;
}

.modal-enter, .modal-leave-to {
  opacity: 0;

  .modal-window {
    opacity: 0;
    transform: translateY(-20px);
  }
}
.privacy-modal-container {
    width: 70vw;
    height: 50vh;
    padding: 50px;
    overflow: scroll;
    text-align: left;
}
</style>
