<template>
  <transition name="modal" appear>
    <div class="modal modal-overlay" @click.self="$emit('close')">
      <div class="modal-window">
        <div class="modal-content">
          <div class="user-modal-container">
            <div class="user-modal-title">서비스 이용 및 회원가입 약관</div>
            <div class="user-modal-subtitle">제1장 총 칙</div>
            <div class="user-modal-bold-content">제1조(목적)</div>
            <div class="user-modal-content">
              가. 본 약관은 주식회사 동행365(이하 "폐업119"라 칭함) 제공하는
              인터넷 사이트 이용과 관련하여 회사(업체)와 이용자 및 이용자간
              권리, 의무 및 책임사항, 기타 필요한 사항을 규정함을 목적으로
              합니다.
            </div>
            <div class="user-modal-bold-content">제2조(정의)</div>
            <div class="user-modal-content">
              가. 본 약관에서 사용하는 용어의 정의는 다음과 같습니다.
              <div class="user-modal-small-content">
                가) “폐업119”라 함은 “콘텐츠” 산업과 관련된 경제활동을 영위하는
                자로서 콘텐츠 및 제반서비스를 제공하는 자를 말합니다.<br />
                나) “이용자” 라 함은 “폐업119”의 사이트에 접속하여 이 약관에
                따라 “폐업119”가 제공하는 “콘텐츠” 및 제반서비스를 이용하는 회원
                및 비회원을 말합니다.<br />
                다) “회원” 이라 함은 “폐업119”와 이용계약을 체결하고 “이용자”
                아이디(ID)를 부여받은 “이용자”로서 “폐업119”의 정보를 지속적으로
                제공받으며, “폐업119”가 제공하는 서비스를 지속적으로 이용할 수
                있는 자를 말합니다. “폐업119”는 원활한 서비스의 제공을 위해
                회원의 등급을 내부규정에 따라 나눌 수 있습니다.<br />
                라) “비회원” 이라 함은 “회원”이 아니면서 “폐업119”이 제공하는
                서비스를 이용하는 자를 말합니다.<br />
                마) “콘텐츠”라 함은 정보통신망이용촉진 및 정보보호 등에 관한
                법률 제2조 제1항 제1호의 규정에 의한 정보통신망에서 사용되는
                부호・문자・음성・음향・이미지 또는 영상 등으로 표현된 자료 또는
                정보로서, 그 보존 및 이용에 있어서 효용을 높일 수 있도록 전자적
                형태로 제작 또는 처리된 것을 말합니다.<br />
                바) “아이디(ID)” 라 함은 “회원” 의 식별과 서비스 이용을 위하여
                “회원” 이 정하고, “폐업119” 가 승인하는 문자 또는 숫자의 조합을
                말합니다.<br />
                사) “비밀번호(PASSWORD)”라 함은 "회원" 이 부여받은 "아이디(ID)"
                의 동일성 확인과 회원정보의 보호를 위하여 회원이 설정하고 회사가
                승인한 문자나 숫자의 조합을 말합니다.<br />
                아) “서비스” 라 함은 구현되는 단말기(PC, 휴대폰 등의 각종기기를
                포함)와 상관없이 회원이 이용할 수 있는 “폐업119” 의 서비스를
                의미합니다.<br />
                자) “운영자” 라 함은 “폐업119” 가 제공하는 서비스의 전반적인
                관리와 원활한 운영을 위하여 “폐업119” 에서 선정한 자를 말합니다.
                위항에서 정의되지 않은 약관상의 용어의 의미는 일반적인
                거래관행에 의합니다.
              </div>
            </div>
            <div class="user-modal-bold-content">제3조(신원정보 등의 제공)</div>
            <div class="user-modal-content">
              가. “폐업119” 는 이 약관의 내용, 상호, 대표자 성명, 영업장 소재지
              주소(소비자의 불만을 처리할 수 있는 곳의 주소를 포함), 전화번호,
              모사전송번호, 전자우편주소, 사업자등록번호, 통신판매업 신고번호 및
              개인정보관리 책임자 등을 이용자가 쉽게 알 수 있도록 온라인 서비스
              초기화면에 게시합니다. 다만, 약관은 이용자가 연결 화면을 통하여 볼
              수 있도록 할 수 있습니다.
            </div>
            <div class="user-modal-bold-content">제4조(약관의 게시 등)</div>
            <div class="user-modal-content">
              가. “폐업119” 는 이 약관의 “회원” 이 그 전부를 인쇄할 수 있고,
              거래과정에서 해당 약관의 내용을 확인할 수 있도록 기술적 조치를
              취합니다.<br />
              나. “폐업119” 는 이 약관의 “이용자” 가 “폐업119”와 이 약관의
              내용에 관하여 질의 및 응답할 수 있도록 기술적 장치를 설치합니다.
            </div>
            <div class="user-modal-bold-content">제5조(약관의 개정 등)</div>
            <div class="user-modal-content">
              가. “폐업119” 는 온라인 디지털콘텐츠산업 발전법, 전자상거래
              등에서의 소비자보호에 관한 법률, 약관의 규제에 관한 법률 등
              관련법을 위배하지 않는 범위에서 이 약관을 개정할 수 있습니다.<br />
              나. “폐업119” 가 약관을 개정할 경우에는 적용일자 및 개정사유를
              명시하여 현행약관과 함께 서비스 초기화면에 그 적용일자 7일
              이전부터 적용일 후 상당한 기간동안 공지하고, 기존회원에게는
              개정약관을 전자우편주소로 전송합니다.<br />
              다. “폐업119”가 약관을 개정할 경우에는 개정약관 공지 후 개정약관의
              적용에 대한 “이용자”의 동의 여부를 확인합니다. “이용자” 가
              개정약관의 적용에 동의하지 않는 경우 “폐업119” 또는 “이용자”는
              콘텐츠 이용 계약을 해지할 수 있습니다. 이때, “폐업119”은
              계약해지로 인하여 “이용자”가 입은 손해를 배상합니다.
            </div>
            <div class="user-modal-bold-content">제6조(약관의 해석)</div>
            <div class="user-modal-content">
              가. “폐업119” 는 서비스 운영을 위해 별도의 운영정책을 마련하여
              운영할 수 있으며, “폐업119” 는 웹 사이트 및 모바일 어플리케이션에
              운영정책을 사전 공지 후 적용합니다.<br />
              나. 본 약관에서 정하지 아니한 사항이나 해석에 대해서는 별도의
              운영정책, 관계법령 또는 상관례에 따릅니다.
            </div>
            <div class="user-modal-subtitle">제2장 회원가입</div>
            <div class="user-modal-bold-content">제7조(회원가입)</div>
            <div class="user-modal-content">
              가. 회원가입은 “이용자” 가 약관의 내용에 대하여 동의를 하고,
              회원가입신청을 한 후, “폐업119”이 이러한 신청에 대하여
              승낙함으로써 체결됩니다.<br />
              나. 회원가입신청서에는 다음 사항을 기재해야 합니다. 1호 또는 3호의
              사항은 필수사항이며, 그 외의 사항은 선택 사항입니다.
              <div class="user-modal-small-content">
                가) “회원” 의 성명 또는 인터넷상 개인식별번호 나) “아이디” 와
                “비밀번호” 다) 전자우편주소 라) 이용하려는 “콘텐츠” 의 종류 마)
                기타 “폐업119” 가 필요하다고 인정하는 사항
              </div>
              다. “폐업119” 은 상기 “이용자” 의 신청에 대하여 회원가입을
              승낙함을 원칙으로 합니다. 다만, “폐업119” 은 다음 각 호에 해당하는
              신청에 대하여는 승낙을 하지 않을 수 있습니다.
              <div class="user-modal-small-content">
                가) 가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이
                있는 경우<br />
                나) 실명이 아니거나 타인의 명의를 이용한 경우<br />다) 허위의
                정보를 기재하거나, “폐업119” 가 제시하는 내용을 기재하지 않은
                경우<br />라) 이용자의 귀책사유로 인하여 승인이 불가능하거나
                기타 규정한 제반 사항을 위반하며 신청하는 경우
              </div>
              라. “폐업119” 은 서비스 관련 설비의 여유가 없거나, 기술상 또는
              업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다. <br />마.
              제 ‘다’ 항과 제 ‘라’ 항에 따라 회원가입 신청의 승낙을 하지
              아니하거나 유보한 경우, “폐업119” 이를 신청자에게 알려야 합니다.
              “폐업119” 의 귀책사유 없이 신청자에게 통지할 수 없는 경우에는
              예외로 합니다. <br />바. 회원가입계약의 성립 시기는 “폐업119” 의
              승낙이 “이용자” 에게 도달한 시점으로 합니다.
            </div>
            <div class="user-modal-bold-content">
              제8조(미성년자의 회원가입에 관한 특칙)
            </div>
            <div class="user-modal-content">
              가. 만 14세 미만의 “이용자” 는 개인정보의 수집 및 이용목적에
              대하여 충분히 숙지하고 부모 등 법정대리인의 동의를 얻은 후에
              회원가입을 신청하고 본인의 개인정보를 제공하여야 합니다.<br />
              나. “폐업119” 는 부모 등 법정대리인의 동의에 대한 확인절차를
              거치지 않은 14세 미만 이용자에 대하여는 가입을 취소 또는
              불허합니다.<br />
              다. 만 14세 미만 “이용자” 의 부모 등 법정대리인은 아동에 대한
              개인정보의 열람, 정정, 갱신을 요청하거나 회원가입 에 대한 동의를
              철회할 수 있으며, 이러한 경우에 “폐업119” 는 지체없이 필요한
              조치를 취해야 합니다.
            </div>
            <div class="user-modal-bold-content">제9조(회원정보의 변경)</div>
            <div class="user-modal-content">
              가. “회원” 은 개인정보관리화면을 통하여 언제든지 자신의 개인정보를
              열람하고 수정할 수 있습니다.<br />
              나. “회원” 은 회원가입 신청 시 기재한 사항이 변경되었을 경우
              온라인으로 수정을 하거나 전자우편 기타 방법으로 “폐업119” 에
              대하여 그 변경사항을 알려야 합니다.<br />
              다. 제 ‘나’ 항의 변경사항을 “폐업119” 에 알리지 않아 발생한
              불이익에 대하여 “폐업119” 는 책임지지 않습니다.
            </div>
            <div class="user-modal-bold-content">
              제10조(“회원”의 “아이디” 및 “비밀번호”의 관리에 대한 의무)
            </div>
            <div class="user-modal-content">
              가. “회원” 의 “아이디” 와 “비밀번호” 에 관한 관리책임은 “회원”
              에게 있으며, 이를 제 3자가 이용하도록 하여서는 안 됩니다.<br />
              나. “회원” 은 “아이디” 및 “비밀번호” 가 도용되거나 제 3자에 의해
              사용되고 있음을 인지한 경우에는 이를 즉시 “폐업119” 에 통지하고
              “폐업119” 의 안내에 따라야 합니다.<br />
              다. 제 ‘나’ 항의 경우에 해당 “회원” 이 “폐업119” 에 그 사실을
              통지하지 않거나, 통지한 경우에도 “폐업119” 의 안내에 따르지 않아
              발생한 불이익에 대하여 “폐업119” 는 책임지지 않습니다.
            </div>
            <div class="user-modal-bold-content">제11조(회원에 대한 통지)</div>
            <div class="user-modal-content">
              가. “폐업119” 가 “회원”에 대한 통지를 하는 경우 “회원” 이 지정한
              전자우편주소로 할 수 있습니다.<br />
              나. “폐업119” 는 “회원” 전체에 대한 통지의 경우 7일 이상 “폐업119”
              의 게시판에 게시함으로써 제 ‘가’ 항의 통지에 갈음할 수 있습니다.
              다만, “회원” 본인의 거래와 관련하여 중대한 영향을 미치는 사항에
              대하여는 제 ‘가’ 항의 통지를 합니다.
            </div>
            <div class="user-modal-bold-content">
              제12조(회원탈퇴 및 자격 상실 등)
            </div>
            <div class="user-modal-content">
              가. “회원” 은 “폐업119” 에 언제든지 탈퇴를 요청할 수 있으며
              “폐업119” 는 즉시 회원탈퇴를 처리합니다.<br />
              나. “회원” 이 다음 각 호의 사유에 해당하는 경우, “폐업119” 는
              회원자격을 제한 및 정지시킬 수 있습니다.
              <div class="user-modal-small-content">
                가) 가입신청 시에 허위내용을 등록한 경우<br />
                나) “폐업119” 의 서비스 이용대금, 기타 “폐업119” 의 서비스
                이용에 관련하여 회원이 부담하는 채무를 기일에 이행하지 않는
                경우<br />
                다) 다른 사람의 “폐업119” 의 서비스 이용을 방해하거나 그 정보를
                도용하는 등 전자상거래 질서를 위협하는 경우<br />
                라) “폐업119” 를 이용하여 법령 또는 이 약관이 금지하거나
                공서양속에 반하는 행위를 하는 경우
              </div>
              다. “폐업119” 가 회원자격을 제한·정지시킨 후, 동일한 행위가 2회
              이상 반복되거나 30일 이내에 그 사유가 시정되지 아니하는 경우
              <div class="user-modal-small-content">
                가) “폐업119” 는 회원자격을 상실시킬 수 있습니다.
              </div>
              라. “폐업119” 가 회원자격을 상실시키는 경우에는 회원등록을
              말소합니다. 이 경우 “회원” 에게 이를 통지하고, 회원 등록 말소 전에
              최소한 30일 이상의 기간을 정하여 소명할 기회를 부여합니다.
            </div>
            <div class="user-modal-subtitle">제3장 콘텐츠이용계약</div>
            <div class="user-modal-bold-content">
              제13조(“콘텐츠”의 내용 등의 게시)
            </div>
            <div class="user-modal-content">
              가. “폐업119” 는 다음 사항을 해당 “콘텐츠”의 이용초기화면이나 그
              포장에 “이용자”가 알기 쉽게 표시합니다.
              <div class="user-modal-small-content">
                가) “콘텐츠”의 명칭 또는 제호<br />
                나) “콘텐츠”의 제작 및 표시 연월일<br />
                다) “콘텐츠” 제작자의 성명(법인인 경우에는 법인의 명칭), 주소,
                전화번호<br />
                라) “콘텐츠”의 내용, 이용방법, 이용료 기타 이용조건
              </div>
              나. “폐업119” 는 “콘텐츠” 별 이용가능기기 및 이용에 필요한
              최소한의 기술사양에 관한 정보를 계약체결과정에서 “이용자”에게
              제공합니다.
            </div>
            <div class="user-modal-bold-content">
              제14조(이용계약의 성립 등)
            </div>
            <div class="user-modal-content">
              가. “이용자” 는 “폐업119” 가 제공하는 다음 또는 이와 유사한 절차에
              의하여 이용신청을 합니다. “폐업119” 는 계약 체결 전에 각 호의
              사항에 관하여 “이용자”가 정확하게 이해하고, 실수 또는 착오 없이
              거래할 수 있도록 정보를 제공합니다.
              <div class="user-modal-small-content">
                가) “콘텐츠” 목록의 열람 및 선택<br />
                나) 성명, 주소, 전화번호(또는 이동전화번호), 전자우편주소 등의
                입력<br />
                다) 약관내용, 청약철회가 불가능한 “콘텐츠”에 대해 “폐업119” 가
                취한 조치에 관련한 내용에 대한 확인<br />
                라) 이 약관에 동의하고 위 제 ‘다’ 호의 사항을 확인하거나
                거부하는 표시<br />
                마) “콘텐츠” 의 이용신청에 관한 확인 또는 “폐업119” 의 확인에
                대한 동의<br />
                바) 결제방법의 선택
              </div>
              나. “폐업119” 는 “이용자” 의 이용신청이 다음 각 호에 해당하는
              경우에는 승낙하지 않거나 승낙을 유보할 수 있습니다.
              <div class="user-modal-small-content">
                가) 실명이 아니거나 타인의 명의를 이용한 경우<br />나) 허위의
                정보를 기재하거나, “폐업119” 가 제시하는 내용을 기재하지 않은
                경우<br />다) 미성년자가 청소년보호법에 의해서 이용이 금지되는
                “콘텐츠” 를 이용하고자 하는 경우 <br />라) 서비스 관련 설비의
                여유가 없거나, 기술상 또는 업무상 문제가 있는 경우
              </div>
              다. “폐업119” 의 승낙이 제 16조 제 ‘가’ 항의 수신확인통지 형태로
              “이용자”에게 도달한 시점에 계약이 성립한 것으로 봅니다.<br />라.
              “폐업119” 의 승낙의 의사표시에는 “이용자” 의 이용신청에 대한 확인
              및 서비스제공 가능여부, 이용신청의 정정· 취소 등에 관한 정보 등을
              포함합니다.
            </div>
            <div class="user-modal-bold-content">
              제15조(미성년자 이용계약에 관한 특칙)
            </div>
            <div class="user-modal-content">
              “폐업119” 는 만 20세 미만의 미성년이용자가 서비스를 이용하고자
              하는 경우에 부모 등 법정 대리인의 동의를 얻거나, 계약체결 후
              추인을 얻지 않으면 미성년자 본인 또는 법정대리인이 그 계약을
              취소할 수 있다는 내용을 계약체결 전에 고지하는 조치를 취합니다.
            </div>
            <div class="user-modal-bold-content">
              제16조(수신확인통지·이용신청 변경 및 취소)
            </div>
            <div class="user-modal-content">
              가. “폐업119” 는 “이용자” 의 이용신청이 있는 경우 “이용자” 에게
              수신확인통지를 합니다.<br />
              나. 수신확인통지를 받은 “이용자” 는 의사표시의 불일치 등이 있는
              경우에는 수신확인통지를 받은 후 즉시 이용신청 변경 및 취소를
              요청할 수 있고, “폐업119” 는 서비스제공 전에 “이용자” 의 요청이
              있는 경우에는 지체 없이 그 요청에 따라 처리하여야 합니다. 다만,
              이미 대금을 지불한 경우에는 청약철회 등에 관한 제 27조의 규정에
              따릅니다.
            </div>
            <div class="user-modal-bold-content">제17조(“폐업119” 의 의무)</div>
            <div class="user-modal-content">
              가. “폐업119” 는 법령과 이 약관이 정하는 권리의 행사와 의무의
              이행을 신의에 좇아 성실하게 하여야 합니다.<br />나. “폐업119” 는
              “이용자” 가 안전하게 “콘텐츠” 를 이용할 수 있도록
              개인정보(신용정보 포함)보호를 위해 보안 시스템을 갖추어야 하며
              개인정보보호정책을 공시하고 준수합니다. <br />다. “폐업119” 는
              “이용자” 가 콘텐츠이용 및 그 대금내역을 수시로 확인할 수 있도록
              조치합니다. <br />라. “폐업119” 는 콘텐츠이용과 관련하여 “이용자”
              로부터 제기된 의견이나 불만이 정당하다고 인정할 경우에는 이를
              지체없이 처리합니다. 이용자가 제기한 의견이나 불만사항에 대해서는
              게시판을 활용하거나 전자우편 등을 통하여 그 처리과정 및 결과를
              전달합니다. <br />마. “폐업119” 는 이 약관에서 정한 의무 위반으로
              인하여 “이용자” 가 입은 손해를 배상합니다.
            </div>
            <div class="user-modal-bold-content">제18조(“이용자” 의 의무)</div>
            <div class="user-modal-content">
              가. “이용자” 는 다음 행위를 하여서는 안 됩니다.
              <div class="user-modal-small-content">
                가) 신청 또는 변경 시 허위내용의 기재<br />
                나) 타인의 정보도용<br />
                다) “폐업119” 에 게시된 정보의 변경<br />라) “폐업119” 가 금지한
                정보(컴퓨터 프로그램 등)의 송신 또는 게시 <br />마) “폐업119”와
                기타 제 3자의 저작권 등 지적재산권에 대한 침해 <br />바)
                “폐업119” 및 기타 제 3자의 명예를 손상시키거나 업무를 방해하는
                행위 <br />사) 외설 또는 폭력적인 말이나 글, 화상, 음향, 기타
                공서양속에 반하는 정보를 “폐업119” 의 사이트에 공개 또는
                게시하는 행위 <br />아) 기타 불법적이거나 부당한 행위
              </div>
              나. “이용자” 는 관계법령, 이 약관의 규정, 이용안내 및 “콘텐츠” 와
              관련하여 공지한 주의사항, “폐업119” 가 통지 하는 사항 등을
              준수하여야 하며, 기타 “폐업119” 의 업무에 방해되는 행위를 하여서는
              안 됩니다.<br />
              다. “이용자" 는 계약 시 세부견적서 내용을 꼼꼼히 확인 후 공사를
              진행해야 합니다. <br />마. "이용자" 는 공사가 지연 또는 중단되어
              분쟁이 발생한 경우, 즉시 당사 "폐업119" 에게 통보해야 합니다.
              <br />바. “이용자” 는 “폐업119” 이 “이용자” 에게 콘텐츠 및
              제반서비스를 제공하기 위하여 “이용자” 의 소유물 또는 점유물의 공사
              전·후 상태를 촬영하는 행위 및 그 촬영을 위하여 “이용자” 의 자택에
              출입하는 행위와 동 촬영물을 상업적으로 이용하는 행위에 동의합니다.
            </div>
            <div class="user-modal-bold-content">제19조(지급방법)</div>
            <div class="user-modal-content">
              콘텐츠” 의 이용에 대한 대금지급방법은 다음 각 호의 방법 중 가능한
              방법으로 할 수 있습니다. 다만, “폐업119” 는 “이용자” 의 지급방법에
              대하여 어떠한 명목의 수수료도 추가하여 징수하지 않습니다.
              <div class="user-modal-small-content">
                가) 가상계좌를 통한 계좌이체<br />
                나) 기타 전자적 지급방법에 의한 대금지급 등
              </div>
            </div>
            <div class="user-modal-bold-content">
              제20조(콘텐츠서비스의 제공 및 중단)
            </div>
            <div class="user-modal-content">
              가. 콘텐츠 서비스는 연중무휴, 1일 24시간 제공함을 원칙으로 합니다.
              <br />나. “폐업119” 는 컴퓨터 등 정보통신설비의 보수점검, 교체 및
              고장, 통신두절 또는 운영상 상당한 이유가 있는 경우 콘텐츠서비스의
              제공을 일시적으로 중단할 수 있습니다. 이 경우 “폐업119” 는
              제11조(“회원”에 대한 통지)에 정한 방법으로 “이용자” 에게
              통지합니다. 다만, “폐업119” 가 사전에 통지할 수 없는 부득이한
              사유가 있는 경우 사후에 통지할 수 있습니다. <br />다. “폐업119” 는
              상당한 이유 없이 콘텐츠 서비스의 제공이 일시적으로 중단됨으로
              인하여 “이용자” 가 입은 손해에 대하여 배상합니다. 다만, “폐업119”
              가 고의 또는 과실이 없음을 입증하는 경우에는 그러하지 아니합니다.
              <br />라. “폐업119” 는 콘텐츠 서비스의 제공에 필요한 경우
              정기점검을 실시할 수 있으며, 정기점검시간은 서비스제공화면 에
              공지한 바에 따릅니다. <br />마. 사업종목의 전환, 사업의 포기, 업체
              간의 통합 등의 이유로 콘텐츠 서비스를 제공할 수 없게 되는 경우에는
              “폐업119”은(는) 제11조(“회원”에 대한 통지)에 정한 방법으로
              “이용자” 에게 통지하고 당초 “폐업119” 에서 제시한 조건에 따라
              “이용자” 에게 보상합니다. 다만, “폐업119” 가 보상기준 등을
              고지하지 아니하거나, 고지한 보상기준이 적절하지 않은 경우에는
              “이용자” 들의 마일리지 또는 적립금 등을 현물 또는 현금으로
              “이용자” 에게 지급합니다.
            </div>
            <div class="user-modal-bold-content">
              제21조(콘텐츠서비스의 변경)
            </div>
            <div class="user-modal-content">
              가. “폐업119” 는 상당한 이유가 있는 경우에 운영상, 기술상의 필요에
              따라 제공하고 있는 콘텐츠 서비스를 변경할 수 있습니다. <br />나.
              “폐업119” 는 콘텐츠 서비스의 내용, 이용방법, 이용시간을 변경할
              경우에 변경사유, 변경될 콘텐츠 서비스의 내용 및 제공일자 등을 그
              변경 전 7일 이상 해당 콘텐츠 초기화면에 게시합니다. <br />다. 제
              ‘나’ 항의 경우에 변경된 내용이 중대하거나 “이용자” 에게 불리한
              경우에는 “폐업119” 가 해당 콘텐츠 서비스 를 제공받는 “이용자” 에게
              제11조(“회원”에 대한 통지)에 정한 방법으로 통지하고 동의를
              받습니다. 이때, “폐업 119” 는 동의를 거절한 “이용자” 에 대하여는
              변경 전 서비스를 제공합니다. 다만, 그러한 서비스 제공이 불가능할
              경우 계약을 해지할 수 있습니다. <br />라. “폐업119” 는 제 ‘가’
              항에 의한 서비스의 변경 및 제 ‘다’ 항에 의한 계약의 해지로 인하여
              “이용자” 가 입은 손해 를 배상합니다.
            </div>
            <div class="user-modal-bold-content">
              제22조 [정보의 제공 및 광고의 게재]
            </div>
            <div class="user-modal-content">
              가. “폐업119” 는 “이용자” 가 콘텐츠 이용 중 필요하다고 인정되는
              다양한 정보를 공지사항이나 전자우편 등의 방법 으로 “회원” 에게
              제공할 수 있습니다. 다만, “회원” 은 언제든지 전자우편 등을 통하여
              수신 거절을 할 수 있습니다. <br />나. 제 ‘가’ 항의 정보를 전화 및
              모사전송기기에 의하여 전송하려고 하는 경우에는 “회원” 의 사전
              동의를 받아서 전송합니다. <br />다. “폐업119” 는 “콘텐츠” 서비스
              제공과 관련하여 콘텐츠 화면, 홈페이지, 전자우편 등에 광고를 게재할
              수 있습니다. 광고가 게재된 전자우편 등을 수신한 “회원” 은
              수신거절을 “폐업119” 에게 할 수 있습니다.
            </div>
            <div class="user-modal-bold-content">제23조(게시물의 삭제)</div>
            <div class="user-modal-content">
              가. “폐업119” 는 게시판에 정보통신망이용촉진 및 정보보호 등에 관한
              법률을 위반한 청소년유해매체물이 게시되어 있는 경우에는 이를
              지체없이 삭제 합니다. <br />나. “폐업119” 가 운영하는 게시판 등에
              게시된 정보로 인하여 법률상 이익이 침해된 자는 “폐업119” 에게 당해
              정보 의 삭제 또는 반박내용의 게재를 요청할 수 있습니다. 이 경우
              “폐업119” 는 지체 없이 필요한 조치를 취하고 이를 즉시 신청인에게
              통지합니다.
            </div>
            <div class="user-modal-bold-content">제24조(저작권 등의 귀속)</div>
            <div class="user-modal-content">
              가. “폐업119” 가 작성한 저작물에 대한 저작권 기타 지적재산권은
              “폐업119” 에 귀속합니다. <br />나. “폐업119” 가 제공하는 서비스 중
              제휴계약에 의해 제공되는 저작물에 대한 저작권 기타 지적재산권은
              해당 제공 업체에 귀속합니다. <br />다. “이용자” 는 “폐업119” 가
              제공하는 서비스를 이용함으로써 얻은 정보 중 “폐업119” 또는
              제공업체에 지적재산권 이 귀속된 정보를 “폐업119” 또는 제공업체의
              사전승낙 없이 복제, 전송, 출판, 배포, 방송 기타 방법에 의하여
              영리목적으로 이용하거나 제 3자에게 이용하게 하여서는 안 됩니다.
              <br />라. “폐업119” 는 약정에 따라 “이용자” 의 저작물을 사용하는
              경우 당해 “이용자” 의 허락을 받습니다.
            </div>
            <div class="user-modal-bold-content">제25조(개인정보보호)</div>
            <div class="user-modal-content">
              가. “폐업119” 는 제 7조 제 나 항의 신청서 기재사항 이외에
              “이용자”의 콘텐츠 이용에 필요한 최소한의 정보를 수집 할 수
              있습니다. 이를 위해 “폐업119” 가 문의한 사항에 관해 “이용자” 는
              진실한 내용을 성실하게 고지하여야 합니다. <br />나. “폐업119” 가
              “이용자” 의 개인 식별이 가능한 “개인정보” 를 수집하는 때에는 당해
              “이용자” 의 동의를 받습니다. <br />다. “폐업119” 는 “이용자” 가
              이용신청 등에서 제공한 정보와 제 ‘가’ 항에 의하여 수집한 정보를
              당해 “이용자” 의 동의없이 목적 외로 이용하거나 제 3자에게 제공할
              수 없으며, 이를 위반한 경우에 모든 책임은 “폐업119” 가 집니다.
              다만, 다음의 경우에는 예외로 합니다.
              <div class="user-modal-small-content">
                가) 통계작성, 학술연구 또는 시장조사를 위하여 필요한 경우로서
                특정 개인을 식별할 수 없는 형태로 제공하는 경우 <br />나)
                “콘텐츠” 제공에 따른 요금정산을 위하여 필요한 경우 <br />다)
                도용방지를 위하여 본인확인에 필요한 경우 <br />라) 약관의 규정
                또는 법령에 의하여 필요한 불가피한 사유가 있는 경우
              </div>
              라. “폐업119” 가 제 나 항과 제 다 항에 의해 “이용자” 의 동의를
              받아야 하는 경우에는 “개인정보” 관리책임자의 신원(소속, 성명 및
              전화번호 기타 연락처), 정보의 수집목적 및 이용목적, 제 3자에 대한
              정보제공관련사항(제공 받는 자, 제공목적 및 제공할 정보의 내용)
              등에 관하여 정보통신망이용촉진 및 정보보호 등에 관한 법률 제22조
              제 나 항이 규정한 사항을 명시하고 고지하여야 합니다. <br />마.
              “이용자” 는 언제든지 제 다 항의 동의를 임의로 철회할 수 있습니다.
              <br />바. “이용자”는 언제든지 “폐업119” 가 가지고 있는 자신의
              “개인정보” 에 대해 열람 및 오류의 정정을 요구할 수 있으며,
              “폐업119” 는 이에대해 지체 없이 필요한 조치를 취할 의무를 집니다.
              “이용자” 가 오류의 정정을 요구한 경우에는 “폐업119” 는 그 오류를
              정정할 때까지 당해 “개인정보” 를 이용하지 않습니다. <br />사.
              “폐업119” 는 개인정보보호를 위하여 관리자를 한정하여 그 수를
              최소화하며 계좌정보 등을 포함한 “이용자” 의 “개인정보” 의 분실,
              도난, 유출, 변조 등으로 인한 “이용자” 의 손해에 대하여 책임을
              집니다. <br />아. “폐업119” 또는 그로부터 “개인정보” 를 제공받은
              자는 “이용자” 가 동의한 범위 내에서 “개인정보” 를 사용할 수
              있으며, 목적이 달성된 경우에는 당해 “개인정보” 를 지체없이
              파기합니다. <br />자. “폐업119” 는 정보통신망이용촉진 및
              정보보호에 관한 법률 등 관계 법령이 정하는 바에 따라 “이용자” 의
              “개인 정보” 를 보호하기 위해 노력합니다. “개인정보” 의 보호 및
              사용에 대해서는 관련법령 및 “폐업119” 의 개인정보 보호정책이
              적용됩니다.
            </div>
            <div class="user-modal-subtitle">
              제4장 콘텐츠이용계약의 청약철회, 계약해제·해지 및 이용제한
            </div>
            <div class="user-modal-bold-content">
              제26조(“이용자” 의 청약철회와 계약해제·해지)
            </div>
            <div class="user-modal-content">
              가. “폐업119”와 “콘텐츠” 의 이용에 관한 계약을 체결한 “이용자” 는
              수신확인의 통지를 받은 날로부터 7일 이내에는 청약의 철회를 할 수
              있습니다. 다만, “폐업119” 가 다음 각 호중 하나의 조치를 취한
              경우에는 “이용자” 의 청약 철회권이 제한될 수 있습니다.
              <div class="user-modal-small-content">
                가) 청약의 철회가 불가능한 “콘텐츠” 에 대한 사실을 표시사항에
                포함한 경우 <br />나) 시용상품을 제공한 경우 <br />다) 한시적
                또는 일부이용 등의 방법을 제공한 경우
              </div>
              나. “이용자” 는 다음 각 호의 사유가 있을 때에는 당해 “콘텐츠” 를
              공급받은 날로부터 3월 이내 또는 그 사실을 안 날 또는 알 수 있었던
              날부터 30일 이내에 콘텐츠 이용계약을 해제·해지할 수 있습니다.
              <div class="user-modal-small-content">
                가) 이용계약에서 약정한 “콘텐츠” 가 제공되지 않는 경우 <br />나)
                제공되는 “콘텐츠” 가 표시·광고 등과 상이하거나 현저한 차이가
                있는 경우 <br />다) 기타 “콘텐츠” 의 결함으로 정상적인 이용이
                현저히 불가능한 경우
              </div>
              다. 제 가 항의 청약철회와 제 나 항의 계약해제·해지는 “이용자”가
              전화, 전자우편 또는 모사전송으로 “폐업119” 에 그 의사를 표시한
              때에 효력이 발생합니다. <br />라. “폐업119” 는 제 다 항에 따라
              “이용자” 가 표시한 청약철회 또는 계약해제·해지의 의사표시를 수신한
              후 지체 없이 이러한 사실을 “이용자” 에게 회신합니다. <br />마.
              “이용자” 는 제 나 항의 사유로 계약해제·해지의 의사표시를 하기 전에
              상당한 기간을 정하여 완전한 “콘텐츠” 혹은 서비스 이용의 하자에
              대한 치유를 요구할 수 있습니다.
            </div>
            <div class="user-modal-bold-content">
              제27조(“폐업119” 의 계약해제·해지 및 이용제한)
            </div>
            <div class="user-modal-content">
              가.“폐업119” 는 “이용자” 가 제 12조 제 나 항에서 정한 행위를
              하였을 경우 사전통지 없이 계약을 해제·해지하거나 또는 기간을
              정하여 서비스이용을 제한할 수 있습니다. <br />나. 제 가 항의
              해제·해지는 “폐업119” 가 자신이 정한 통지방법에 따라 “이용자” 에게
              그 의사를 표시한 때에 효력이 발생합니다. <br />다. “폐업119” 의
              해제·해지 및 이용제한에 대하여 “이용자” 는 “폐업119” 가 정한
              절차에 따라 이의신청을 할 수 있습 니다. 이 때 이의가 정당하다고
              “폐업119” 가 인정하는 경우, “폐업119” 는 즉시 서비스의 이용을
              재개합니다.
            </div>
            <div class="user-modal-subtitle">제5장 피해보상 등</div>
            <div class="user-modal-bold-content">
              제28조(콘텐츠하자 등에 의한 이용자피해보상)
            </div>
            <div class="user-modal-content">
              “폐업119” 는 콘텐츠하자 등에 의한 이용자피해보상의 기준·범위·방법
              및 절차에 관한 사항을 디지털콘텐츠이용자보호 지침에 따라
              처리합니다.
            </div>
            <div class="user-modal-bold-content">제29조(면책조항)</div>
            <div class="user-modal-content">
              가. “폐업119” 는 천재지변 또는 이에 준하는 불가항력으로 인하여
              “콘텐츠”를 제공할 수 없는 경우에는 “콘텐츠” 제공에 관한 책임이
              면제됩니다. <br />② “폐업119”은(는) “이용자”의 귀책사유로 인한
              콘텐츠이용의 장애에 대하여는 책임을 지지 않습니다. <br />③
              “폐업119”은(는) “회원”이 “콘텐츠”와 관련하여 게재한 정보, 자료,
              사실의 신뢰도, 정확성 등의 내용에 관하여는 책임을 지지 않습니다.
              <br />④ “폐업119”은(는) “이용자” 상호간 또는 “이용자”와 제3자 간에
              “콘텐츠”를 매개로 하여 발생한 분쟁 등에 대하여 책임을 지지
              않습니다.
            </div>
            <div class="user-modal-bold-content">제30조(분쟁의 해결)</div>
            <div class="user-modal-content">
              “폐업119” 는 분쟁이 발생하였을 경우에 “이용자” 가 제기하는 정당한
              의견이나 불만을 반영하여 적절하고 신속한 조치를 취합니다. 다만,
              신속한 처리가 곤란한 경우에 “폐업119” 는 “이용자” 에게 그 사유와
              처리일정을 통보합니다.
            </div>
          </div>
        </div>
        <footer class="modal-footer">
          <button class="modal-confirm-btn" @click="$emit('close')">확인</button>
        </footer>
      </div>
    </div>
  </transition>
</template>

<style lang="stylus" scoped>
.modal {
  &.modal-overlay {
    display: flex;
    align-items: center;
    justify-content: center;
    position: fixed;
    z-index: 1000;
    top: 0;
    left: 0;
    width: 100%;
    height: 100%;
    background: rgba(0, 0, 0, 0.5);
  }

  &-window {
    background: #fff;
    border-radius: 4px;
    max-height: 90%;
    overflow: auto;
  }

  &-content {
    padding: 10px 20px;
  }

  &-footer {
    background: #ccc;
    padding: 10px;
    text-align: center;
    justify-content: center;
  }
}
.address {
    text-align: left;
    width: 65%;
    height: 35px;
    background: #fff;
    overflow: hidden;
    padding-top: 5px;
    padding-left: 10px
    margin-top: 15px;
}
// 오버레이 트랜지션
.modal-enter-active, .modal-leave-active {
  transition: opacity 0.4s;

  // 오버레이에 포함되어 있는 모달 윈도의 트랜지션
  .modal-window {
    transition: opacity 0.4s, transform 0.4s;
  }
}

// 딜레이가 적용된 모달 윈도가 제거된 후에 오버레이가 사라짐
.modal-leave-active {
  transition: opacity 0.6s ease 0.4s;
}

.modal-enter, .modal-leave-to {
  opacity: 0;

  .modal-window {
    opacity: 0;
    transform: translateY(-20px);
  }
}
.user-modal-container {
    width: 70vw;
    height: 50vh;
    padding: 50px;
    overflow: scroll;
    text-align: left;
}
.user-modal-title {
    text-align: center;
    font-size: 24px;
}
.user-modal-subtitle {
    text-align: center;
    margin-top: 10px;
    margin-bottom: 10px;
    font-size: 21px;
}
.user-modal-content {
    margin-top: 5px;
    margin-bottom: 5px;
    margin-left: 15px;
}
.user-modal-small-content {
    margin-left: 25px;
}
.modal-confirm-btn {
  border: 0;
  background: transparent;
}
</style>
